package com.user;

import java.util.ArrayList;
import java.util.List;

import com.book.BookComment;
import com.common.DAO;

public class UserMyDAO extends DAO{
//====================================================
// 1.개인정보수정 | 2. 작성 댓글 조회 | 3. 홈페이지로 | 4. 로그아웃
//====================================================
//(1)개인정보수정
//======================================
// 1. 비밀번호변경 | 2. 회원탈퇴 | 3. 뒤로가기
//======================================
//(2) 작성댓글 조회
//===========================페이징
//1. 상세보기 | 2. 댓글 삭제 | 3.뒤로가기
//============================
//
//(2-3)작성댓글조회
//// 책별로 댓글 table이 따로 존재하고 책ID와 회원ID로 각각의 테이블에 접근할 수 있음.
//==================
//================== 다음페이지>>
	
	//비밀번호 변경 >> user에 있음
	//회원탈퇴>> user에 있음
	
	
	BookComment bc = new BookComment();
	
	
}
